{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 3, "nb_row": 1, "bias": true}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "bias": true}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_3", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "bias": true}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_4", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_5", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_6", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true}, "name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "trainable": true, "name": "convolution2d_7", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true}, "name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "name": "maxpooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"name": "flatten_3", "trainable": true}, "name": "flatten_3", "class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"config": {"name": "merge_1", "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "output_shape": null, "output_mask": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]]}, {"config": {"input_dim": 20480, "W_regularizer": null, "b_constraint": null, "output_dim": 512, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "name": "dense_1", "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"input_dim": 512, "W_regularizer": null, "b_constraint": null, "output_dim": 128, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "name": "dense_2", "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"input_dim": 128, "W_regularizer": null, "b_constraint": null, "output_dim": 16, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "name": "dense_3", "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"input_dim": 16, "W_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_4", "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]]}], "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.0"}