{"config": {"output_layers": [["dense_4", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 40, 160, 3], "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"nb_row": 1, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "activation": "relu", "nb_filter": 3, "b_constraint": null, "nb_col": 1, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "maxpooling2d_3", "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_6", "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "bias": true, "trainable": true, "W_constraint": null, "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_7", "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_4"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "maxpooling2d_4", "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "flatten_2", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_3", "class_name": "Flatten"}, {"config": {"arguments": {}, "concat_axis": -1, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "name": "merge_1", "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}, "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]], "name": "merge_1", "class_name": "Merge"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "input_dim": 20480, "W_regularizer": null, "output_dim": 512}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "input_dim": 512, "W_regularizer": null, "output_dim": 128}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "input_dim": 128, "W_regularizer": null, "output_dim": 16}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "b_constraint": null, "input_dim": 16, "W_regularizer": null, "output_dim": 1}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.0", "class_name": "Model"}